import tkinter as tk
from tkinter import ttk


class frame_d(ttk.Frame):
    def __init__(self, root) -> None:
        super().__init__(master=root)
        self.richang = ({'帮派强盗': '12:30:00', '门派闯关': '21:00:00', '竞技场活动': '22:00:00'},
                {'帮派百草谷': '12:30:00', '帮派答题': '20:20:00', '帮派竞赛': '21:00:00'},
                {'九黎演武': '12:15:00', '召唤灵乐园': '21:00:00', '风云竞技场': '22:00:00'},
                {'帮派百草谷': '12:30:00', '帮派答题': '20:20:00', '帮派竞赛': '21:00:00'},
                {'帮派迷阵': '12:00:00', '勇闯迷魂塔': '19:00:00', '剑会群英': '20:00:30'},
                {'不周山神': '11:00:00', '剑会群英': '12:00:30', '小猪快跑': '12:05:00', 
                    '科举会试1': '13:00:00', '科举|不周': '15:00:00', '不周山神': '19:00:00', 
                    '科举会试3': '20:00:00', '决战九华山': '21:00:00', '帮派车轮战': '22:00:00', '不周山神': '23:00:00'},
                {'不周山神': '11:00:00', '剑会群英': '12:00:30', '帮派秘境': '12:30:00', '不周山神': '15:00:00', 
                    '擂台大挑战': '17:00:00', '梦幻迷城': '18:30:00', '不周山神': '19:00:00', '比武大会': '21:00:00', 
                    '比武大会-结束': '22:20:00', '不周山神': '23:00:00'}, )
        

        self.disha = {'地煞1': '09:30:30', '地煞2': '11:30:30', '地煞3': '13:30:30', '地煞4': '15:30:30',
                      '地煞5': '17:30:30', '地煞6': '19:30:30', '地煞7': '22:30:30', '地煞8': '23:30:30'}
        
        self.yuanchen = {}
        for i in range(24):
            self.yuanchen['元辰' + str(i)] = '{}:00:15'.format(str(i).zfill(2))

        self.hufu = {'上古灵符1': '10:10:00', '上古灵符2': '16:10:00', 
                     '上古咒符1': '12:10:00', '上古咒符2': '18:10:00', 
                     '上古护符1': '14:10:00', '上古护符2': '20:10:00'}



        notebook = ttk.Notebook(self)
        


if __name__ == '__main__':
    root = tk.Tk()
    root.geometry('450x300+1200+550')
    frame_d(root=root).place(x=220, y=95)
    root.mainloop()